# -*- coding: utf-8 -*-
# Update Date: 2024/12/19
__author__ = 'chilamchou'

import sys

#################################################################
#   Visual Studio Code -- Shift + ALT + F -- 程式碼自動排版
#################################################################

constVersionInfo = 'V001'
constVersionDate = '2024-12-19-18:23'

#######################################################################################################################
#######################################################################################################################
#######################################################################################################################

M__1O   = 0x00      #  0 一萬 0
M__2O   = 0x01      #  1 二萬 1
M__3O   = 0x02      #  2 三萬 2
M__4O   = 0x03      #  3 四萬 3
M__5O   = 0x04      #  4 五萬 4
M__6O   = 0x05      #  5 六萬 5
M__7O   = 0x06      #  6 七萬 6
M__8O   = 0x07      #  7 八萬 7
M__9O   = 0x08      #  8 九萬 8

M__1T   = 0x10      #  9 一筒 16
M__2T   = 0x11      # 10 二筒 17
M__3T   = 0x12      # 11 三筒 18 
M__4T   = 0x13      # 12 四筒 19
M__5T   = 0x14      # 13 五筒 20
M__6T   = 0x15      # 14 六筒 21 
M__7T   = 0x16      # 15 七筒 22
M__8T   = 0x17      # 16 八筒 23
M__9T   = 0x18      # 17 九筒 24

M__1S   = 0x20      # 18 一索 32
M__2S   = 0x21      # 19 二索 33
M__3S   = 0x22      # 20 三索 34 
M__4S   = 0x23      # 21 四索 35
M__5S   = 0x24      # 22 五索 36
M__6S   = 0x25      # 23 六索 37
M__7S   = 0x26      # 24 七索 38
M__8S   = 0x27      # 25 八索 39
M__9S   = 0x28      # 26 九索 40

M_W01   = 0x30      # 27 字牌( 1) 48
M_W02   = 0x31      # 28 字牌( 2) 49
M_W03   = 0x32      # 29 字牌( 3) 50
M_W04   = 0x33      # 30 字牌( 4) 51
M_W05   = 0x34      # 31 字牌( 5) 52
M_W06   = 0x35      # 32 字牌( 6) 53
M_W07   = 0x36      # 33 字牌( 7) 54
M_W08   = 0x37      # 34 字牌( 8) 55
M_W09   = 0x38      # 35 字牌( 9) 56
M_W10   = 0x39      # 36 字牌(10) 57
M_W11   = 0x3A      # 37 字牌(11) 58
M_W12   = 0x3B      # 38 字牌(12) 59

M_JK1   = 0x40      # 39 賴子( 1) 64
M_JK2   = 0x41      # 40 賴子( 2) 65
M_JK3   = 0x42      # 41 賴子( 3) 66
M_JK4   = 0x43      # 42 賴子( 4) 67
M_JK5   = 0x44      # 43 賴子( 5) 68
M_JK6   = 0x45      # 44 賴子( 6) 69
M_JK7   = 0x46      # 45 賴子( 7) 70
M_JK8   = 0x47      # 46 賴子( 8) 71

# 這邊不描述道具牌章, 因為在沒胡牌前, 道具牌會直接使用
# 胡牌後, 道具牌為自動執行自摸動作

MAHJONG_MAX_DATA_LEN = 47   # 麻將所有牌面牌章數量

M_COVER = 0xEE      # 背面牌
M_EMPTY = 0xFF      # 空值

M_TYPE_0 = 0x00     # 萬
M_TYPE_1 = 0x10     # 筒
M_TYPE_2 = 0x20     # 索
M_TYPE_3 = 0x30     # 字牌
M_TYPE_4 = 0x40     # 賴子


# 使用tuple來建立相關Mahjong數值處理Array , 因為此資料皆不可更改
MjToAry = (
    # 1~9萬牌
   0 ,  1 ,  2 ,  3 ,  4 ,  5 ,  6 ,  7 ,  8 , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY ,
    # 1~9筒牌   
   9 , 10 , 11 , 12 , 13 , 14 , 15 , 16 , 17 , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY ,
    # 1~9索牌   
  18 , 19 , 20 , 21 , 22 , 23 , 24 , 25 , 26 , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY ,
    # 字牌1~12種
  27 , 28 , 29 , 30 , 31 , 32 , 33 , 34 , 35 , 36 , 37 , 38 , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY ,
    # 賴子1~8種
  39 , 40 , 41 , 42 , 43 , 44 , 45 , 46 , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY , M_EMPTY )

AryToMj = (
  M__1O , M__2O , M__3O , M__4O , M__5O , M__6O , M__7O , M__8O , M__9O ,
  M__1T , M__2T , M__3T , M__4T , M__5T , M__6T , M__7T , M__8T , M__9T ,
  M__1S , M__2S , M__3S , M__4S , M__5S , M__6S , M__7S , M__8S , M__9S ,
  M_W01 , M_W02 , M_W03 , M_W04 , M_W05 , M_W06 , M_W07 , M_W08 , M_W09 , M_W10 , M_W11 , M_W12 ,
  M_JK1 , M_JK2 , M_JK3 , M_JK4 , M_JK5 , M_JK6 , M_JK7 , M_JK8 )

IndexToMjName = (
  'A01' , 'A02' , 'A03' , 'A04' , 'A05' , 'A06' , 'A07' , 'A08' , 'A09' ,
  'B01' , 'B02' , 'B03' , 'B04' , 'B05' , 'B06' , 'B07' , 'B08' , 'B09' ,
  'C01' , 'C02' , 'C03' , 'C04' , 'C05' , 'C06' , 'C07' , 'C08' , 'C09' ,
  'W01' , 'W02' , 'W03' , 'W04' , 'W05' , 'W06' , 'W07' , 'W08' , 'W09' , 'W10' , 'W11' , 'W12' ,
  'JK1' , 'JK2' , 'JK3' , 'JK4' , 'JK5' , 'JK6' , 'JK7' , 'JK8' )

#######################################################################################################################
#######################################################################################################################
#######################################################################################################################


# 麻將Hex值轉名稱
mapMahjongHexToName = {
    0x00:'A01', 0x01:'A02', 0x02:'A03', 0x03:'A04', 0x04:'A05', 0x05:'A06', 0x06:'A07', 0x07:'A08', 0x08:'A09',
    0x10:'B01', 0x11:'B02', 0x12:'B03', 0x13:'B04', 0x14:'B05', 0x15:'B06', 0x16:'B07', 0x17:'B08', 0x18:'B09',
    0x20:'C01', 0x21:'C02', 0x22:'C03', 0x23:'C04', 0x24:'C05', 0x25:'C06', 0x26:'C07', 0x27:'C08', 0x28:'C09',
    0x30:'W01', 0x31:'W02', 0x32:'W03', 0x33:'W04', 0x34:'W05', 0x35:'W06', 0x36:'W07', 0x37:'W08', 0x38:'W09', 0x39:'W10', 0x3A:'W11', 0x3B:'W12',
    0x40:'JK1', 0x41:'JK2', 0x42:'JK3', 0x43:'JK4', 0x44:'JK5', 0x45:'JK6', 0x46:'JK7', 0x47:'JK8', 0xFF:'EMPTY'
}

# 麻將名稱轉Hex值
mapMahjongNameToHex = {
    'A01':0x00, 'A02':0x01, 'A03':0x02, 'A04':0x03, 'A05':0x04, 'A06':0x05, 'A07':0x06, 'A08':0x07, 'A09':0x08,
    'B01':0x10, 'B02':0x11, 'B03':0x12, 'B04':0x13, 'B05':0x14, 'B06':0x15, 'B07':0x16, 'B08':0x17, 'B09':0x18,
    'C01':0x20, 'C02':0x21, 'C03':0x22, 'C04':0x23, 'C05':0x24, 'C06':0x25, 'C07':0x26, 'C08':0x27, 'C09':0x28,  
    'W01':0x30, 'W02':0x31, 'W03':0x32, 'W04':0x33, 'W05':0x34, 'W06':0x35, 'W07':0x36, 'W08':0x37, 'W09':0x38, 'W10':0x39, 'W11':0x3A, 'W12':0x3B,
    'JK1':0x40, 'JK2':0x41, 'JK3':0x42, 'JK4':0x43, 'JK5':0x44, 'JK6':0x45, 'JK7':0x46, 'JK8':0x47, 'EMPTY':0xFF
}

# 麻將名稱轉Index值
mapMahjongNameToIndex = {
    'A01': 0, 'A02': 1, 'A03': 2, 'A04': 3, 'A05': 4, 'A06': 5, 'A07': 6, 'A08': 7, 'A09': 8,
    'B01': 9, 'B02':10, 'B03':11, 'B04':12, 'B05':13, 'B06':14, 'B07':15, 'B08':16, 'B09':17,
    'C01':18, 'C02':19, 'C03':20, 'C04':21, 'C05':22, 'C06':23, 'C07':24, 'C08':25, 'C09':26,  
    'W01':27, 'W02':28, 'W03':29, 'W04':30, 'W05':31, 'W06':32, 'W07':33, 'W08':34, 'W09':35, 'W10':36, 'W11':37, 'W12':38,
    'JK1':39, 'JK2':40, 'JK3':41, 'JK4':42, 'JK5':43, 'JK6':44, 'JK7':45, 'JK8':46
}

# 麻將花色定義
MJ_SUIT_CHAR    = 0x00     # 萬
MJ_SUIT_DOT     = 0x10     # 筒
MJ_SUIT_BAMBOO  = 0x20     # 索
MJ_SUIT_WORD    = 0x30     # 字
MJ_SUIT_JOKER   = 0x40     # 賴子
conSuitTypeGroup = ( MJ_SUIT_CHAR, MJ_SUIT_DOT, MJ_SUIT_BAMBOO, MJ_SUIT_WORD, MJ_SUIT_JOKER )


# 麻將吃碰槓定義
OPEN_CHOW = 'Chow'      # 吃牌
OPEN_PONG = 'Pong'      # 碰牌
OPEN_ADD_KONG = 'AddKong'   # 碰牌加槓
OPEN_KONG = 'Kong'      # 明槓
OPEN_CONCEALED_KONG = 'ConcealedKong'       # 暗槓


EXECUTE_DISCARD    = 'DisCard'      # 捨牌動作

EXECUTE_SELF_WHO    = 'SelfWho'     # 自摸胡
EXECUTE_OTHER_WHO   = 'OtherWho'    # 放槍胡

EXECUTE_PASS   = 'Pass'             # 針對判斷其他家的捨牌 - 執行過的動作


conGameRuleMap = {
    # 瘋狂金鉤釣
    'CrazyGoldHook':{       

        # 定義牌盒內有哪些牌
        'mahjongBoxHex' : {
            M__1O : 4, M__2O : 4, M__3O : 4, M__4O : 4, M__5O : 4, M__6O : 4, M__7O : 4, M__8O : 4, M__9O : 4,
            M__1S : 4, M__2S : 4, M__3S : 4, M__4S : 4, M__5S : 4, M__6S : 4, M__7S : 4, M__8S : 4, M__9S : 4,
            M_W01 : 4, M_W02 : 4, M_W03 : 4, M_W04 : 4, M_W05 : 4, M_W06 : 4, M_W07 : 4, M_W08 : 4, M_W09 : 4, M_W10 : 4, M_W11 : 4, M_W12 : 4,
            M_JK1 : 4, M_JK2 : 4, M_JK3 : 4
        },

        # 定義牌盒內有哪些牌
        'mahjongBoxName' : {
            'A01' : 4, 'A02' : 4, 'A03' : 4, 'A04' : 4, 'A05' : 4, 'A06' : 4, 'A07' : 4, 'A08' : 4, 'A09' : 4,
            'C01' : 4, 'C02' : 4, 'C03' : 4, 'C04' : 4, 'C05' : 4, 'C06' : 4, 'C07' : 4, 'C08' : 4, 'C09' : 4,
            'W01' : 4, 'W02' : 4, 'W03' : 4, 'W04' : 4, 'W05' : 4, 'W06' : 4, 'W07' : 4, 'W08' : 4, 'W09' : 4, 'W10' : 4, 'W11' : 4, 'W12' : 4,
            'JK1' : 4, 'JK2' : 4, 'JK3' : 4
        },        


        # 排序大小 , 透過MjToAry所取得的數值來運作 , 所以不用在特別針對各別玩法來定義
        'jokerChangeGroup' : [ M__1O, M__2O, M__3O, M__4O, M__5O, M__6O, M__7O, M__8O, M__9O,
                               M__1S, M__2S, M__3S, M__4S, M__5S, M__6S, M__7S, M__8S, M__9S,
                               M_W01, M_W02, M_W03, M_W04, M_W05, M_W06, M_W07, M_W08, M_W09, M_W10, M_W11, M_W12 
        ],

        'jokerDefineGroup' : [ M_JK1, M_JK2, M_JK3 ],

        'jokerDefineNameGroup' : [ 'JK1', 'JK2', 'JK3' ],

        # 一般花色定義有哪些, 金勾釣只有萬與索
        'normalSuitGroup' : [ MJ_SUIT_CHAR, MJ_SUIT_BAMBOO ],

        'openTypeGroup' : [ OPEN_PONG, OPEN_KONG, OPEN_CONCEALED_KONG ],        # 允許的吃碰槓類型

            
    }
}

# 合法手上牌張數 , 不包含摸進來的牌
conOnHandLegalNum = [ 1 , 4 , 7 , 10 , 13 ]


conSuitMahjongNameMap = {
    MJ_SUIT_CHAR : ( 'A01', 'A02', 'A03', 'A04', 'A05', 'A06', 'A07', 'A08', 'A09' ),
    MJ_SUIT_DOT : ( 'B01', 'B02', 'B03', 'B04', 'B05', 'B06', 'B07', 'B08', 'B09' ),
    MJ_SUIT_BAMBOO : ( 'C01', 'C02', 'C03', 'C04', 'C05', 'C06', 'C07', 'C08', 'C09' ),
    MJ_SUIT_WORD : ( 'W01', 'W02', 'W03', 'W04', 'W05', 'W06', 'W07', 'W08', 'W09', 'W10', 'W11', 'W12' ),
    MJ_SUIT_JOKER : ( 'JK1', 'JK2', 'JK3' )
}


conSuitMahjongRangeMap = {
    MJ_SUIT_CHAR : ( 0, 1, 2, 3, 4, 5, 6, 7, 8 ),
    MJ_SUIT_DOT : ( 9, 10, 11, 12, 13, 14, 15, 16, 17 ),
    MJ_SUIT_BAMBOO : ( 18, 19, 20, 21, 22, 23, 24, 25, 26 ),
    MJ_SUIT_WORD : ( 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38 ),
    MJ_SUIT_JOKER : ( 39, 40, 41, 42, 43, 44, 45, 46 )
}





# --------------------------------------------------------------------------------------------
# --------------------------------------------------------------------------------------------
# --------------------------------------------------------------------------------------------

#                           刻搭         順搭
conJokerChangeTypeGroup = ( 'JK_AAA' , 'JK_ABC' )


# 依據判斷牌章 可以形成的合法順搭組合定義

'''
conMapMahjongABC = {
    M__1O : ( -1, -1,  0,  1,  2 ),    # 一萬可以形成的順搭, 一二三萬
    M__2O : ( -1,  0,  1,  2,  3 ),    # 二萬可以形成的順搭, 一二三萬,二三四萬,
    M__3O : (  0,  1,  2,  3,  4 ),    # 三萬可以形成的順搭, 一二三萬,二三四萬,三四五萬    
    M__4O : (  1,  2,  3,  4,  5 ),    # 四萬可以形成的順搭, 二三四萬,三四五萬,四五六萬        
    M__5O : (  2,  3,  4,  5,  6 ),    # 五萬可以形成的順搭, 三四五萬,四五六萬,五六七萬    
    M__6O : (  3,  4,  5,  6,  7 ),    # 六萬可以形成的順搭, 四五六萬,五六七萬,六七八萬        
    M__7O : (  4,  5,  6,  7,  8 ),    # 七萬可以形成的順搭, 五六七萬,六七八萬,七八九萬            
    M__8O : (  5,  6,  7,  8, -1 ),    # 八萬可以形成的順搭, 六七八萬,七八九萬
    M__9O : (  6,  7,  8, -1, -1 ),    # 九萬可以形成的順搭, 七八九萬

    M__1T : ( -1, -1, 16, 17, 18 ),    # 一筒可以形成的順搭, 一二三筒
    M__2T : ( -1, 16, 17, 18, 19 ),    # 二筒可以形成的順搭, 一二三筒,二三四筒,
    M__3T : ( 16, 17, 18, 19, 20 ),    # 三筒可以形成的順搭, 一二三筒,二三四筒,三四五筒    
    M__4T : ( 17, 18, 19, 20, 21 ),    # 四筒可以形成的順搭, 二三四筒,三四五筒,四五六筒        
    M__5T : ( 18, 19, 20, 21, 22 ),    # 五筒可以形成的順搭, 三四五筒,四五六筒,五六七筒    
    M__6T : ( 19, 20, 21, 22, 23 ),    # 六筒可以形成的順搭, 四五六筒,五六七筒,六七八筒        
    M__7T : ( 20, 21, 22, 23, 24 ),    # 七筒可以形成的順搭, 五六七筒,六七八筒,七八九筒            
    M__8T : ( 21, 22, 23, 24, -1 ),    # 八筒可以形成的順搭, 六七八筒,七八九筒
    M__9T : ( 22, 23, 24, -1, -1 ),    # 九筒可以形成的順搭, 七八九筒

    M__1S : ( -1, -1, 32, 33, 34 ),    # 一索可以形成的順搭, 一二三索
    M__2S : ( -1, 32, 33, 34, 35 ),    # 二索可以形成的順搭, 一二三索,二三四索,
    M__3S : ( 32, 33, 34, 35, 36 ),    # 三索可以形成的順搭, 一二三索,二三四索,三四五索
    M__4S : ( 33, 34, 35, 36, 37 ),    # 四索可以形成的順搭, 二三四索,三四五索,四五六索        
    M__5S : ( 34, 35, 36, 37, 38 ),    # 五索可以形成的順搭, 三四五索,四五六索,五六七索    
    M__6S : ( 35, 36, 37, 38, 39 ),    # 六索可以形成的順搭, 四五六索,五六七索,六七八索        
    M__7S : ( 36, 37, 38, 39, 40 ),    # 七索可以形成的順搭, 五六七索,六七八索,七八九索            
    M__8S : ( 37, 38, 39, 40, -1 ),    # 八索可以形成的順搭, 六七八索,七八九索
    M__9S : ( 38, 39, 40, -1, -1 )     # 九索可以形成的順搭, 七八九索    
}
'''

conMapMahjongABC = {
    M__1O : ( -1, -1,  0,  1,  2 ),    # 一萬可以形成的順搭, 一二三萬
    M__2O : ( -1,  0,  1,  2,  3 ),    # 二萬可以形成的順搭, 一二三萬,二三四萬,
    M__3O : (  0,  1,  2,  3,  4 ),    # 三萬可以形成的順搭, 一二三萬,二三四萬,三四五萬    
    M__4O : (  1,  2,  3,  4,  5 ),    # 四萬可以形成的順搭, 二三四萬,三四五萬,四五六萬        
    M__5O : (  2,  3,  4,  5,  6 ),    # 五萬可以形成的順搭, 三四五萬,四五六萬,五六七萬    
    M__6O : (  3,  4,  5,  6,  7 ),    # 六萬可以形成的順搭, 四五六萬,五六七萬,六七八萬        
    M__7O : (  4,  5,  6,  7,  8 ),    # 七萬可以形成的順搭, 五六七萬,六七八萬,七八九萬            
    M__8O : (  5,  6,  7,  8, -1 ),    # 八萬可以形成的順搭, 六七八萬,七八九萬
    M__9O : (  6,  7,  8, -1, -1 ),    # 九萬可以形成的順搭, 七八九萬

    M__1T : ( -1, -1,  9, 10, 11 ),    # 一筒可以形成的順搭, 一二三筒
    M__2T : ( -1,  9, 10, 11, 12 ),    # 二筒可以形成的順搭, 一二三筒,二三四筒,
    M__3T : (  9, 10, 11, 12, 13 ),    # 三筒可以形成的順搭, 一二三筒,二三四筒,三四五筒    
    M__4T : ( 10, 11, 12, 13, 14 ),    # 四筒可以形成的順搭, 二三四筒,三四五筒,四五六筒        
    M__5T : ( 11, 12, 13, 14, 15 ),    # 五筒可以形成的順搭, 三四五筒,四五六筒,五六七筒    
    M__6T : ( 12, 13, 14, 15, 16 ),    # 六筒可以形成的順搭, 四五六筒,五六七筒,六七八筒        
    M__7T : ( 13, 14, 15, 16, 17 ),    # 七筒可以形成的順搭, 五六七筒,六七八筒,七八九筒            
    M__8T : ( 14, 15, 16, 17, -1 ),    # 八筒可以形成的順搭, 六七八筒,七八九筒
    M__9T : ( 15, 16, 17, -1, -1 ),    # 九筒可以形成的順搭, 七八九筒

    M__1S : ( -1, -1, 18, 19, 20 ),    # 一索可以形成的順搭, 一二三索
    M__2S : ( -1, 18, 19, 20, 21 ),    # 二索可以形成的順搭, 一二三索,二三四索,
    M__3S : ( 18, 19, 20, 21, 22 ),    # 三索可以形成的順搭, 一二三索,二三四索,三四五索
    M__4S : ( 19, 20, 21, 22, 23 ),    # 四索可以形成的順搭, 二三四索,三四五索,四五六索        
    M__5S : ( 20, 21, 22, 23, 24 ),    # 五索可以形成的順搭, 三四五索,四五六索,五六七索    
    M__6S : ( 21, 22, 23, 24, 25 ),    # 六索可以形成的順搭, 四五六索,五六七索,六七八索        
    M__7S : ( 22, 23, 24, 25, 26 ),    # 七索可以形成的順搭, 五六七索,六七八索,七八九索            
    M__8S : ( 23, 24, 25, 26, -1 ),    # 八索可以形成的順搭, 六七八索,七八九索
    M__9S : ( 24, 25, 26, -1, -1 )     # 九索可以形成的順搭, 七八九索    
}

conMapMahjongNameABC = {
    'A01' : ( -1, -1,  0,  1,  2 ),    # 一萬可以形成的順搭, 一二三萬
    'A02' : ( -1,  0,  1,  2,  3 ),    # 二萬可以形成的順搭, 一二三萬,二三四萬,
    'A03' : (  0,  1,  2,  3,  4 ),    # 三萬可以形成的順搭, 一二三萬,二三四萬,三四五萬    
    'A04' : (  1,  2,  3,  4,  5 ),    # 四萬可以形成的順搭, 二三四萬,三四五萬,四五六萬        
    'A05' : (  2,  3,  4,  5,  6 ),    # 五萬可以形成的順搭, 三四五萬,四五六萬,五六七萬    
    'A06' : (  3,  4,  5,  6,  7 ),    # 六萬可以形成的順搭, 四五六萬,五六七萬,六七八萬        
    'A07' : (  4,  5,  6,  7,  8 ),    # 七萬可以形成的順搭, 五六七萬,六七八萬,七八九萬            
    'A08' : (  5,  6,  7,  8, -1 ),    # 八萬可以形成的順搭, 六七八萬,七八九萬
    'A09' : (  6,  7,  8, -1, -1 ),    # 九萬可以形成的順搭, 七八九萬

    'B01' : ( -1, -1,  9, 10, 11 ),    # 一筒可以形成的順搭, 一二三筒
    'B02' : ( -1,  9, 10, 11, 12 ),    # 二筒可以形成的順搭, 一二三筒,二三四筒,
    'B03' : (  9, 10, 11, 12, 13 ),    # 三筒可以形成的順搭, 一二三筒,二三四筒,三四五筒    
    'B04' : ( 10, 11, 12, 13, 14 ),    # 四筒可以形成的順搭, 二三四筒,三四五筒,四五六筒        
    'B05' : ( 11, 12, 13, 14, 15 ),    # 五筒可以形成的順搭, 三四五筒,四五六筒,五六七筒    
    'B06' : ( 12, 13, 14, 15, 16 ),    # 六筒可以形成的順搭, 四五六筒,五六七筒,六七八筒        
    'B07' : ( 13, 14, 15, 16, 17 ),    # 七筒可以形成的順搭, 五六七筒,六七八筒,七八九筒            
    'B08' : ( 14, 15, 16, 17, -1 ),    # 八筒可以形成的順搭, 六七八筒,七八九筒
    'B09' : ( 15, 16, 17, -1, -1 ),    # 九筒可以形成的順搭, 七八九筒

    'C01' : ( -1, -1, 18, 19, 20 ),    # 一索可以形成的順搭, 一二三索
    'C02' : ( -1, 18, 19, 20, 21 ),    # 二索可以形成的順搭, 一二三索,二三四索,
    'C03' : ( 18, 19, 20, 21, 22 ),    # 三索可以形成的順搭, 一二三索,二三四索,三四五索
    'C04' : ( 19, 20, 21, 22, 23 ),    # 四索可以形成的順搭, 二三四索,三四五索,四五六索        
    'C05' : ( 20, 21, 22, 23, 24 ),    # 五索可以形成的順搭, 三四五索,四五六索,五六七索    
    'C06' : ( 21, 22, 23, 24, 25 ),    # 六索可以形成的順搭, 四五六索,五六七索,六七八索        
    'C07' : ( 22, 23, 24, 25, 26 ),    # 七索可以形成的順搭, 五六七索,六七八索,七八九索            
    'C08' : ( 23, 24, 25, 26, -1 ),    # 八索可以形成的順搭, 六七八索,七八九索
    'C09' : ( 24, 25, 26, -1, -1 )     # 九索可以形成的順搭, 七八九索    
}


# --------------------------------------------------------------------------------------------
# --------------------------------------------------------------------------------------------
# --------------------------------------------------------------------------------------------

mapMahjongCName = {
    0x00:u'一萬', 0x01:u'二萬', 0x02:u'三萬', 0x03:u'四萬', 0x04:u'五萬', 0x05:u'六萬', 0x06:u'七萬', 0x07:u'八萬', 0x08:u'九萬',
    0x10:u'一筒', 0x11:u'二筒', 0x12:u'三筒', 0x13:u'四筒', 0x14:u'五筒', 0x15:u'六筒', 0x16:u'七筒', 0x17:u'八筒', 0x18:u'九筒',
    0x20:u'一索', 0x21:u'二索', 0x22:u'三索', 0x23:u'四索', 0x24:u'五索', 0x25:u'六索', 0x26:u'七索', 0x27:u'八索', 0x28:u'九索',

    0x30:u'字牌(01)', 0x31:u'字牌(02)', 0x32:u'字牌(03)', 0x33:u'字牌(04)', 0x34:u'字牌(05)', 0x35:u'字牌(06)', 0x36:u'字牌(07)', 0x37:u'字牌(08)', 0x38:u'字牌(09)', 0x39:u'字牌(10)', 0x3A:u'字牌(11)', 0x3B:u'字牌(12)',

    0x40:u'賴子(01)', 0x41:u'賴子(02)', 0x42:u'賴子(03)', 0x43:u'賴子(04)', 0x44:u'賴子(05)', 0x45:u'賴子(06)', 0x46:u'賴子(07)', 0x47:u'賴子(08)', 0xFF:u'空空'
}

def displayMahjongCName( mahjongList, titleName ):
    
    outputStr = ""
    for mahjong in mahjongList:       
        outputStr += mapMahjongCName[ mahjong ] + " "    
    
    print("titleName, ", outputStr)


        

    

    


# --------------------------------------------------------------------------------------------
# --------------------------------------------------------------------------------------------
# --------------------------------------------------------------------------------------------
